{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "String": "[SEP1]"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "Split",
        "pattern": {
          "String": "[SEP2]"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "Split",
        "pattern": {
          "String": "[SEP3]"
        },
        "behavior": "Isolated",
        "invert": false
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      ",": 5,
      "0": 6,
      "1": 7,
      "2": 8,
      "3": 9,
      "4": 10,
      "5": 11,
      "6": 12,
      "7": 13,
      "8": 14,
      "9": 15,
      "E": 16,
      "F": 17,
      "I": 18,
      "N": 19,
      "P": 20,
      "R": 21,
      "S": 22,
      "T": 23,
      "W": 24,
      "[": 25,
      "]": 26,
      "e": 27,
      "f": 28,
      "h": 29,
      "i": 30,
      "l": 31,
      "n": 32,
      "o": 33,
      "r": 34,
      "t": 35,
      "u": 36,
      "y": 37,
      "][": 38,
      "EP": 39,
      "SEP": 40,
      "[SEP": 41,
      "][1": 42,
      "No": 43,
      "ne": 44,
      "None": 45,
      "][None": 46,
      "][0": 47,
      "If": 48,
      "2]": 49,
      "1]": 50,
      "3]": 51,
      "][If": 52,
      "Re": 53,
      "rn": 54,
      "tu": 55,
      "Retu": 56,
      "Return": 57,
      "[SEP2]": 58,
      "[SEP1]": 59,
      "[SEP3]": 60,
      "][2": 61,
      "[1": 62,
      "][Return": 63,
      "][3": 64,
      "][0][0": 65,
      "][None][None": 66,
      ",2": 67,
      "][1][1": 68,
      "][][": 69,
      "[1,2": 70,
      "[If": 71,
      "][4": 72,
      ",1": 73,
      "][None][If": 74,
      "[2]": 75,
      "Fo": 76,
      "For": 77,
      "][For": 78,
      "[1]": 79,
      "[0": 80,
      "][Return]": 81,
      "][1][0": 82,
      "][]": 83,
      "][5": 84,
      "[]": 85,
      "[None": 86,
      ",4": 87,
      "][1]": 88,
      "][None]": 89,
      "][6": 90,
      "[3]": 91,
      "][3,4": 92,
      "[1][2": 93,
      "][][]": 94,
      ",3": 95,
      "[Return": 96,
      "[Return]": 97,
      "][If][Return": 98,
      "][7": 99,
      "Tr": 100,
      "Try": 101,
      "][None][Return]": 102,
      "][None][None]": 103,
      ",6": 104,
      ",5": 105,
      "][8": 106,
      "[None][For": 107,
      "][If][If": 108,
      "[4": 109,
      "][1][0][0": 110,
      "[1][2,3": 111,
      "][2]": 112,
      "[1,2][2": 113,
      "[If][Return": 114,
      "[1,2][": 115,
      "][2][0": 116,
      "][9": 117,
      "][None][If][None][If": 118,
      "[4]": 119,
      "][10": 120,
      "][Try": 121,
      "][4,5": 122,
      "[1,2][3": 123,
      "][1][1]": 124,
      ",7": 125,
      "[1,2][][3,4": 126,
      ",8": 127,
      "[2": 128,
      "[1,2][][]": 129,
      "][11": 130,
      "][5,6": 131,
      "][If][None][None": 132,
      "][0][0][0][0": 133,
      "][1][2": 134,
      "][None][For": 135,
      "][1][0]": 136,
      "][][5": 137,
      "][12": 138,
      "[If][None][If": 139,
      "][0]": 140,
      "[None]": 141,
      "[5": 142,
      "][6,7": 143,
      "[0][0": 144,
      ",9": 145,
      "][3]": 146,
      "][13": 147,
      ",10": 148,
      "][None][Return": 149,
      "][7,8": 150,
      "[1,2][2][3,4": 151,
      "[Try": 152,
      "[If][None][Return]": 153,
      "[5]": 154,
      "][14": 155,
      "][1][1][0": 156,
      "[If][None][None": 157,
      "][If][None][If": 158,
      "[1][2,3][4": 159,
      "[1,2][2][]": 160,
      "][15": 161,
      "[1,2][3,4": 162,
      "[1][0": 163,
      "][8,9": 164,
      ",11": 165,
      "][0][0][0": 166,
      ",12": 167,
      "][3][4,5": 168,
      "][9,10": 169,
      "[3": 170,
      "][3][]": 171,
      "][1][0][1][0": 172,
      "][][5,6": 173,
      "][16": 174,
      "[If][Return][Return]": 175,
      "][1][3": 176,
      "[1][2,3][1": 177,
      "][0][0]": 178,
      "][10,11": 179,
      "][11,12": 180,
      "[1][2,3][4,1": 181,
      "][4][5,6": 182,
      "[6": 183,
      "][Try][None][None": 184,
      "][][7": 185,
      "Wh": 186,
      "il": 187,
      "][Wh": 188,
      "ile": 189,
      "][While": 190,
      "][17": 191,
      "][][6": 192,
      "][If][If][None][None": 193,
      "][If][None]": 194,
      "][2][0]": 195,
      "[0]": 196,
      "][1][2]": 197,
      "][2][2": 198,
      "[None][For][If][Return": 199,
      "][If][Return][If][Return": 200,
      "][4]": 201,
      ",13": 202,
      "][1][1][1][1": 203,
      "][][4": 204,
      "[1][]": 205,
      "[1][2,3][4,5": 206,
      "[If][None][If][None][If": 207,
      ",14": 208,
      "][18": 209,
      "[6]": 210,
      "][If][None][None]": 211,
      "][None][None][For": 212,
      "[1][2,3][1][]": 213,
      "][12,13": 214,
      "][13,14": 215,
      "][19": 216,
      "[1,2][][3,4][][5,6": 217,
      "][3][0": 218,
      "[If][None][None]": 219,
      "[0][0][0": 220,
      "[1,2][][3,4][][]": 221,
      ",15": 222,
      "][Return][Return]": 223,
      "][4][]": 224,
      "][1][1][1]": 225,
      "][If][Return][Return]": 226,
      "][6][7,8": 227,
      ",16": 228,
      "][20": 229,
      "][][9": 230,
      "[7": 231,
      "][5]": 232,
      "][If][For": 233,
      "][5][6,7": 234,
      "][2][1]": 235,
      "][1][0][0][0": 236,
      "[None][For][None][Return]": 237,
      "][Return][None]": 238,
      "[0][1][0": 239,
      "][1][0][0]": 240,
      "][][7,8": 241,
      "][21": 242,
      "][None][None][None]": 243,
      "[1][2][3,4": 244,
      "][14,15": 245,
      "[1][2][3": 246,
      "][15,16": 247,
      "][][8": 248,
      "][2][0][0": 249,
      "][1][2][0": 250,
      "][1][4": 251,
      "][1][0][1][1": 252,
      "[1,2][3][3][]": 253,
      "[0][1][1": 254,
      "[2][0": 255,
      ",17": 256,
      "[1,2][3][4,5": 257,
      "][22": 258,
      "][1][0][1]": 259,
      "][None][Try": 260,
      ",18": 261,
      "[1,2][2][3,4][4][5,6": 262,
      "[7]": 263,
      "[If][None]": 264,
      "[1,2][3,4][5,6": 265,
      "[Try][None][None": 266,
      "][If][None][Return]": 267,
      "][If][If][None][If": 268,
      "][23": 269,
      "[None][While": 270,
      "[1][2][1]": 271,
      "[1][1][1": 272,
      "[1,2][3][3][4,5": 273,
      "][5][]": 274,
      "][2][2]": 275,
      "][16,17": 276,
      "][6]": 277,
      "][If][Return][None]": 278,
      "[0][0][0][0][0": 279,
      "][8][9,10": 280,
      "[1,2][3][][4": 281,
      "][None][Try][None][None": 282,
      "[1,2][][3,4][5": 283,
      "][][1]": 284,
      "[If][None][None][For": 285,
      "][1][3]": 286,
      "][2][1][1": 287,
      "][If][None][If][None][If": 288,
      "][24": 289,
      "][][][]": 290,
      "[1,2][][3][4,5": 291,
      "][17,18": 292,
      "][6][]": 293,
      "][7][8,9": 294,
      ",19": 295,
      "][If][If][Return": 296,
      "][][3": 297,
      "[1][2][3,1": 298,
      "[8": 299,
      "][If][None][None][None]": 300,
      "[1][0][0": 301,
      "[1,2][2][3,4][5": 302,
      "][None][Return][For": 303,
      ",20": 304,
      "][25": 305,
      "][None][If][None]": 306,
      "[If][None][If][None][Return]": 307,
      "][1][0][2": 308,
      "][4][0": 309,
      "][Try][Return": 310,
      "][][6,7": 311,
      "[None][For][None]": 312,
      "][][9,10": 313,
      "[If][None][None][Return]": 314,
      "[0][2": 315,
      "][None][If][None][None]": 316,
      "[0][1][0][0": 317,
      "][18,19": 318,
      "[0][1][1]": 319,
      "][26": 320,
      "][19,20": 321,
      "][If][None][Return": 322,
      "][None][If][None][None": 323,
      "[If][None][If][Return": 324,
      "[1,2][3,2": 325,
      "][10][11,12": 326,
      "][27": 327,
      ",21": 328,
      "][1][1][0][0": 329,
      "][1][1][0]": 330,
      "][If][Return]": 331,
      "][7]": 332,
      ",22": 333,
      "][1][5": 334,
      "[1,2][3][4": 335,
      "][3][3": 336,
      "[8]": 337,
      "[1,2][3][][4,5": 338,
      "][0][0][0][0][0][0][0][0": 339,
      "[If][If][Return": 340,
      "[If][Return][If][Return][If][Return": 341,
      "[0][1][0]": 342,
      "[If][Return][If][Return][Return]": 343,
      "[1,2][2][3,4][4][]": 344,
      "[None][For][If][Return][None]": 345,
      "[1][2,3][4,1][][1]": 346,
      "][5,6][7,8": 347,
      "][None][None][Return]": 348,
      "[1][1][1]": 349,
      "[0][0][0][0": 350,
      "][6,3": 351,
      "][For][Return": 352,
      "[1,2][][3,4][][5,6][][7,8": 353,
      "[9": 354,
      "][None][For][None]": 355,
      "][9][10,11": 356,
      "][28": 357,
      "[0][3": 358,
      "[1][1][0": 359,
      "][3][4": 360,
      "][29": 361,
      "][None][If][None][If][None][If][None][If": 362,
      "][21,22": 363,
      "][6][7": 364,
      "][20,21": 365,
      "[1,2][2][3][4,5": 366,
      "][If][None][None][For": 367,
      "][1][0][0][0][0": 368,
      ",23": 369,
      "][][8,9": 370,
      "][1][2][1]": 371,
      "[1,2][3,4][5": 372,
      "[3][0": 373,
      "][1][6": 374,
      ",24": 375,
      "][6,7][8": 376,
      "][2][3": 377,
      "][1][2][0]": 378,
      "[If][Return][None][For": 379,
      "[1][1][0]": 380,
      "][][11,12": 381,
      "][8]": 382,
      "][None][If][None][Return]": 383,
      "[If][None][Try][None][None": 384,
      ",1][1]": 385,
      "][8][]": 386,
      "[If][None][For": 387,
      "][None][While": 388,
      "][1][0][1][1]": 389,
      "][For][None][None": 390,
      "][7][7": 391,
      "[1][2,3][4,5][": 392,
      "[1][2][]": 393,
      "][6,7][8,9": 394,
      "[0][0][1]": 395,
      "[1,2][][3,4][][5,6][][]": 396,
      "][12][13,14": 397,
      "][1][3][0": 398,
      "][3][0]": 399,
      "[1,2][3][][]": 400,
      "[1,2][][3,4][4][5,6": 401,
      "][][3]": 402,
      "][11][12,13": 403,
      "][If][None][For": 404,
      "][None][If][Return": 405,
      "][3][1]": 406,
      "][22,23": 407,
      "[If][Return][None]": 408,
      "[If][Return][If][Return": 409,
      "][23,24": 410,
      "][30": 411,
      "][If][If][If][None][None": 412,
      "][If][If][None][Return": 413,
      "][2][1][0": 414,
      "][3][0][0": 415,
      "[1,2][2][3,4][4][5,6][6][7,8": 416,
      "][Try][If][None][None": 417,
      "][7,8][9,10": 418,
      "][1][4]": 419,
      "[If][None][If][None][None]": 420,
      "[Try][None][Return": 421,
      "[9]": 422,
      "][][10": 423,
      "[10": 424,
      ",25": 425,
      "][5][0": 426,
      "[1][2,3][1][4,5": 427,
      "[If][For": 428,
      "][If][None][None][Return]": 429,
      "[0][1][2": 430,
      ",26": 431,
      "[1,2][][3][]": 432,
      "[1][2,3][4,1][][]": 433,
      "][][6][]": 434,
      "][2][0][2][0": 435,
      "][1][1][2": 436,
      "][31": 437,
      "][If][None][If][None][None": 438,
      "][1][0][0][0]": 439,
      "[None][For][For": 440,
      "][0][0][0][0]": 441,
      "][1][7": 442,
      "][0][0][0][0][0": 443,
      "][9]": 444,
      "][1][1][0][1]": 445,
      "][5,6][7": 446,
      "[None][Return]": 447,
      "[0][1][2]": 448,
      "[1][0][1]": 449,
      "[1][2,3][4,1][][5": 450,
      "][][2]": 451,
      "][1][0][1][0]": 452,
      "[None][None]": 453,
      "][3][4][5,6": 454,
      "][Try][None][None]": 455,
      "][2][1][2": 456,
      "[0][2][0": 457,
      "][If][If][None][None]": 458,
      "[1][2,3][4,5][][6": 459,
      "][24,25": 460,
      "[1,2][3][4,3": 461,
      "][][10,11": 462,
      "][32": 463,
      "[None][For][If][None]": 464,
      "][1][0][1][0][0": 465,
      "[Try][Return][Return]": 466,
      "[2][0][0": 467,
      "][None][If][For": 468,
      "[If][If][If][None][None": 469,
      "][7,8][9": 470,
      "][Try][None][Return": 471,
      "][25,26": 472,
      "[1,2][3][4,5][6,7": 473,
      ",28": 474,
      "[Try][None][None][Return]": 475,
      "][4][1]": 476,
      "][1][1][1][1]": 477,
      "][If][None][If][None]": 478,
      ",27": 479,
      "][7][]": 480,
      "][][13,14": 481,
      "[1][1]": 482,
      "][5][6,7][8,9": 483,
      "][If][None][If][None][None]": 484,
      "[1][2][3,1][1]": 485,
      "[1,2][][3,4][4][]": 486,
      "[0][1][1][0": 487,
      "[0][1][0][1][0": 488,
      "[1][2][3,4][5": 489,
      "][8][9": 490,
      "][33": 491,
      "][14][15,16": 492,
      "][13][14,15": 493,
      "[If][None][If][None][None": 494,
      "][If][None][If][Return": 495,
      "][1][0][0][1]": 496,
      "[If][None][If][None]": 497,
      "][][11": 498,
      "][0][0][0]": 499
    },
    "merges": [
      "] [",
      "E P",
      "S EP",
      "[ SEP",
      "][ 1",
      "N o",
      "n e",
      "No ne",
      "][ None",
      "][ 0",
      "I f",
      "2 ]",
      "1 ]",
      "3 ]",
      "][ If",
      "R e",
      "r n",
      "t u",
      "Re tu",
      "Retu rn",
      "[SEP 2]",
      "[SEP 1]",
      "[SEP 3]",
      "][ 2",
      "[ 1",
      "][ Return",
      "][ 3",
      "][0 ][0",
      "][None ][None",
      ", 2",
      "][1 ][1",
      "][ ][",
      "[1 ,2",
      "[ If",
      "][ 4",
      ", 1",
      "][None ][If",
      "[ 2]",
      "F o",
      "Fo r",
      "][ For",
      "[ 1]",
      "[ 0",
      "][Return ]",
      "][1 ][0",
      "][ ]",
      "][ 5",
      "[ ]",
      "[ None",
      ", 4",
      "][1 ]",
      "][None ]",
      "][ 6",
      "[ 3]",
      "][3 ,4",
      "[1 ][2",
      "][][ ]",
      ", 3",
      "[ Return",
      "[Return ]",
      "][If ][Return",
      "][ 7",
      "T r",
      "Tr y",
      "][None ][Return]",
      "][None][None ]",
      ", 6",
      ", 5",
      "][ 8",
      "[None ][For",
      "][If ][If",
      "[ 4",
      "][1 ][0][0",
      "[1][2 ,3",
      "][ 2]",
      "[1,2 ][2",
      "[If ][Return",
      "[1,2 ][",
      "][2 ][0",
      "][ 9",
      "][None][If ][None][If",
      "[4 ]",
      "][1 0",
      "][ Try",
      "][4 ,5",
      "[1,2 ][3",
      "][1][1 ]",
      ", 7",
      "[1,2][ ][3,4",
      ", 8",
      "[ 2",
      "[1,2 ][][]",
      "][1 1",
      "][5 ,6",
      "][If ][None][None",
      "][0][0 ][0][0",
      "][1 ][2",
      "][None ][For",
      "][1][0 ]",
      "][][ 5",
      "][1 2",
      "[If ][None][If",
      "][0 ]",
      "[None ]",
      "[ 5",
      "][6 ,7",
      "[0 ][0",
      ", 9",
      "][ 3]",
      "][1 3",
      ",1 0",
      "][None ][Return",
      "][7 ,8",
      "[1,2][2 ][3,4",
      "[ Try",
      "[If ][None][Return]",
      "[5 ]",
      "][1 4",
      "][1][1 ][0",
      "[If ][None][None",
      "][If ][None][If",
      "[1][2,3 ][4",
      "[1,2][2 ][]",
      "][1 5",
      "[1,2 ][3,4",
      "[1 ][0",
      "][8 ,9",
      ",1 1",
      "][0][0 ][0",
      ",1 2",
      "][3 ][4,5",
      "][9 ,10",
      "[ 3",
      "][3 ][]",
      "][1][0 ][1][0",
      "][][5 ,6",
      "][1 6",
      "[If][Return ][Return]",
      "][1 ][3",
      "[1][2,3 ][1",
      "][0][0 ]",
      "][10 ,11",
      "][11 ,12",
      "[1][2,3][4 ,1",
      "][4 ][5,6",
      "[ 6",
      "][Try ][None][None",
      "][][ 7",
      "W h",
      "i l",
      "][ Wh",
      "il e",
      "][Wh ile",
      "][1 7",
      "][][ 6",
      "][If][If ][None][None",
      "][If ][None]",
      "][2][0 ]",
      "[0 ]",
      "][1 ][2]",
      "][2 ][2",
      "[None][For ][If][Return",
      "][If][Return ][If][Return",
      "][4 ]",
      ",1 3",
      "][1][1 ][1][1",
      "][][ 4",
      "[1 ][]",
      "[1][2,3 ][4,5",
      "[If ][None][If][None][If",
      ",1 4",
      "][1 8",
      "[6 ]",
      "][If ][None][None]",
      "][None][None ][For",
      "[1][2,3][1 ][]",
      "][12 ,13",
      "][13 ,14",
      "][1 9",
      "[1,2][][3,4 ][][5,6",
      "][3 ][0",
      "[If ][None][None]",
      "[0 ][0][0",
      "[1,2][][3,4 ][][]",
      ",1 5",
      "][Return ][Return]",
      "][4 ][]",
      "][1][1 ][1]",
      "][If][Return ][Return]",
      "][6 ][7,8",
      ",1 6",
      "][2 0",
      "][][ 9",
      "[ 7",
      "][5 ]",
      "][If ][For",
      "][5 ][6,7",
      "][2 ][1]",
      "][1][0][0 ][0",
      "[None][For ][None][Return]",
      "][Return ][None]",
      "[0 ][1][0",
      "][1][0][0 ]",
      "][][7 ,8",
      "][2 1",
      "][None][None ][None]",
      "[1][2 ][3,4",
      "][14 ,15",
      "[1][2 ][3",
      "][15 ,16",
      "][][ 8",
      "][2 ][0][0",
      "][1 ][2][0",
      "][1 ][4",
      "][1][0 ][1][1",
      "[1,2][3 ][3][]",
      "[0 ][1][1",
      "[2 ][0",
      ",1 7",
      "[1,2][3 ][4,5",
      "][2 2",
      "][1][0 ][1]",
      "][None ][Try",
      ",1 8",
      "[1,2][2][3,4 ][4][5,6",
      "[7 ]",
      "[If ][None]",
      "[1,2][3,4 ][5,6",
      "[Try ][None][None",
      "][If ][None][Return]",
      "][If][If ][None][If",
      "][2 3",
      "[None ][While",
      "[1][2 ][1]",
      "[1 ][1][1",
      "[1,2][3 ][3][4,5",
      "][5 ][]",
      "][2 ][2]",
      "][16 ,17",
      "][6 ]",
      "][If][Return ][None]",
      "[0 ][0][0][0][0",
      "][8 ][9,10",
      "[1,2][3 ][][4",
      "][None ][Try][None][None",
      "[1,2][][3,4 ][5",
      "][ ][1]",
      "[If][None][None ][For",
      "][1 ][3]",
      "][2 ][1][1",
      "][If ][None][If][None][If",
      "][2 4",
      "][][ ][]",
      "[1,2][ ][3][4,5",
      "][17 ,18",
      "][6 ][]",
      "][7 ][8,9",
      ",1 9",
      "][If ][If][Return",
      "][ ][3",
      "[1][2][3 ,1",
      "[ 8",
      "][If][None][None ][None]",
      "[1 ][0][0",
      "[1,2][2][3,4 ][5",
      "][None][Return ][For",
      ",2 0",
      "][2 5",
      "][None][If ][None]",
      "[If][None][If ][None][Return]",
      "][1][0 ][2",
      "][4 ][0",
      "][Try ][Return",
      "][][6 ,7",
      "[None][For ][None]",
      "][][9 ,10",
      "[If][None][None ][Return]",
      "[0 ][2",
      "][None][If ][None][None]",
      "[0 ][1][0][0",
      "][18 ,19",
      "[0 ][1][1]",
      "][2 6",
      "][19 ,20",
      "][If ][None][Return",
      "][None][If ][None][None",
      "[If][None][If ][Return",
      "[1,2][3 ,2",
      "][10 ][11,12",
      "][2 7",
      ",2 1",
      "][1][1 ][0][0",
      "][1][1 ][0]",
      "][If ][Return]",
      "][7 ]",
      ",2 2",
      "][1 ][5",
      "[1,2][3 ][4",
      "][3 ][3",
      "[8 ]",
      "[1,2][3][][4 ,5",
      "][0][0][0][0 ][0][0][0][0",
      "[If ][If][Return",
      "[If][Return ][If][Return][If][Return",
      "[0 ][1][0]",
      "[If][Return ][If][Return][Return]",
      "[1,2][2][3,4 ][4][]",
      "[None][For][If][Return ][None]",
      "[1][2,3][4,1 ][][1]",
      "][5,6 ][7,8",
      "][None][None ][Return]",
      "[1 ][1][1]",
      "[0 ][0][0][0",
      "][6 ,3",
      "][For ][Return",
      "[1,2][][3,4][][5,6 ][][7,8",
      "[ 9",
      "][None][For ][None]",
      "][9 ][10,11",
      "][2 8",
      "[0 ][3",
      "[1 ][1][0",
      "][3 ][4",
      "][2 9",
      "][None][If][None][If ][None][If][None][If",
      "][21 ,22",
      "][6 ][7",
      "][20 ,21",
      "[1,2][2 ][3][4,5",
      "][If][None][None ][For",
      "][1][0][0 ][0][0",
      ",2 3",
      "][][8 ,9",
      "][1][2 ][1]",
      "[1,2][3,4 ][5",
      "[3 ][0",
      "][1 ][6",
      ",2 4",
      "][6,7 ][8",
      "][2 ][3",
      "][1 ][2][0]",
      "[If][Return ][None][For",
      "[1 ][1][0]",
      "][ ][11,12",
      "][8 ]",
      "][None][If ][None][Return]",
      "[If ][None][Try][None][None",
      ",1 ][1]",
      "][8 ][]",
      "[If ][None][For",
      "][None ][While",
      "][1][0 ][1][1]",
      "][For ][None][None",
      "][7 ][7",
      "[1][2,3][4,5 ][",
      "[1][2 ][]",
      "][6,7 ][8,9",
      "[0][0 ][1]",
      "[1,2][][3,4][][5,6 ][][]",
      "][12 ][13,14",
      "][1][3 ][0",
      "][3 ][0]",
      "[1,2][3 ][][]",
      "[1,2][][3,4 ][4][5,6",
      "][][ 3]",
      "][11 ][12,13",
      "][If ][None][For",
      "][None][If ][Return",
      "][3 ][1]",
      "][22 ,23",
      "[If][Return ][None]",
      "[If][Return ][If][Return",
      "][23 ,24",
      "][3 0",
      "][If][If ][If][None][None",
      "][If][If ][None][Return",
      "][2 ][1][0",
      "][3 ][0][0",
      "[1,2][2][3,4][4][5,6 ][6][7,8",
      "][Try ][If][None][None",
      "][7,8 ][9,10",
      "][1 ][4]",
      "[If][None][If ][None][None]",
      "[Try ][None][Return",
      "[9 ]",
      "][ ][10",
      "[1 0",
      ",2 5",
      "][5 ][0",
      "[1][2,3][1 ][4,5",
      "[If ][For",
      "][If][None][None ][Return]",
      "[0 ][1][2",
      ",2 6",
      "[1,2][ ][3][]",
      "[1][2,3][4,1 ][][]",
      "][][6 ][]",
      "][2][0 ][2][0",
      "][1][1 ][2",
      "][3 1",
      "][If][None][If ][None][None",
      "][1][0][0 ][0]",
      "[None][For ][For",
      "][0][0][0][0 ]",
      "][1 ][7",
      "][0][0][0][0 ][0",
      "][9 ]",
      "][1][1][0 ][1]",
      "][5,6 ][7",
      "[None ][Return]",
      "[0 ][1][2]",
      "[1][0 ][1]",
      "[1][2,3][4,1 ][][5",
      "][][ 2]",
      "][1][0 ][1][0]",
      "[None ][None]",
      "][3 ][4][5,6",
      "][Try ][None][None]",
      "][2 ][1][2",
      "[0 ][2][0",
      "][If][If ][None][None]",
      "[1][2,3][4,5 ][][6",
      "][24 ,25",
      "[1,2][3][4 ,3",
      "][ ][10,11",
      "][3 2",
      "[None][For ][If][None]",
      "][1][0 ][1][0][0",
      "[Try ][Return][Return]",
      "[2 ][0][0",
      "][None][If ][For",
      "[If ][If][If][None][None",
      "][7,8 ][9",
      "][Try ][None][Return",
      "][25 ,26",
      "[1,2][3][4,5 ][6,7",
      ",2 8",
      "[Try][None][None ][Return]",
      "][4 ][1]",
      "][1][1 ][1][1]",
      "][If][None][If ][None]",
      ",2 7",
      "][7 ][]",
      "][ ][13,14",
      "[1 ][1]",
      "][5][6,7 ][8,9",
      "][If][None][If ][None][None]",
      "[1][2][3,1 ][1]",
      "[1,2][][3,4 ][4][]",
      "[0 ][1][1][0",
      "[0 ][1][0][1][0",
      "[1][2][3,4 ][5",
      "][8 ][9",
      "][3 3",
      "][14 ][15,16",
      "][13 ][14,15",
      "[If][None][If ][None][None",
      "][If][None][If ][Return",
      "][1][0][0 ][1]",
      "[If][None][If ][None]",
      "][ ][11",
      "][0][0 ][0]"
    ]
  }
}