{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "A": 5,
      "B": 6,
      "C": 7,
      "D": 8,
      "E": 9,
      "F": 10,
      "G": 11,
      "H": 12,
      "I": 13,
      "J": 14,
      "K": 15,
      "L": 16,
      "M": 17,
      "N": 18,
      "O": 19,
      "P": 20,
      "Q": 21,
      "R": 22,
      "S": 23,
      "T": 24,
      "U": 25,
      "V": 26,
      "W": 27,
      "X": 28,
      "Y": 29,
      "_": 30,
      "E_": 31,
      "D_": 32,
      "LO": 33,
      "LOA": 34,
      "LOAD_": 35,
      "NA": 36,
      "ME_": 37,
      "NAME_": 38,
      "NAME_LOAD_": 39,
      "ST": 40,
      "_A": 41,
      "RI": 42,
      "CO": 43,
      "NT": 44,
      "TE_": 45,
      "TT": 46,
      "BU": 47,
      "RIBU": 48,
      "TTRIBU": 49,
      "TTRIBUTE_": 50,
      "ANT": 51,
      "NST": 52,
      "CONST": 53,
      "CONSTANT": 54,
      "OR": 55,
      "NAME_LOAD_LOAD_": 56,
      "AL": 57,
      "CAL": 58,
      "CALL": 59,
      "CONSTANT_": 60,
      "TTRIBUTE_NAME_LOAD_LOAD_": 61,
      "STOR": 62,
      "STORE_": 63,
      "N_": 64,
      "_NAME_LOAD_": 65,
      "CALL_A": 66,
      "NAME_STORE_": 67,
      "SI": 68,
      "RG": 69,
      "SSI": 70,
      "SSIG": 71,
      "_ARG": 72,
      "SSIGN_": 73,
      "EX": 74,
      "PR": 75,
      "CALL_ATTRIBUTE_NAME_LOAD_LOAD_": 76,
      "SSIGN_NAME_STORE_": 77,
      "EXPR": 78,
      "EXPR_": 79,
      "ATTRIBUTE_NAME_LOAD_LOAD_": 80,
      "CALL_NAME_LOAD_": 81,
      "SU": 82,
      "SUB": 83,
      "PT": 84,
      "IF": 85,
      "TU": 86,
      "LE_": 87,
      "CRI": 88,
      "SCRI": 89,
      "SUBSCRI": 90,
      "SUBSCRIPT": 91,
      "CONSTANT_A": 92,
      "ASSIGN_NAME_STORE_": 93,
      "COM": 94,
      "_ARG_ARG": 95,
      "IF_": 96,
      "CONSTANT_LOAD_": 97,
      "COMP": 98,
      "CALL_ATTRIBUTE_": 99,
      "CT": 100,
      "NO": 101,
      "MO": 102,
      "ND": 103,
      "EY": 104,
      "KEY": 105,
      "WOR": 106,
      "KEYWOR": 107,
      "KEYWORD_": 108,
      "AR": 109,
      "COMPAR": 110,
      "COMPARE_": 111,
      "SUBSCRIPT_NAME_LOAD_": 112,
      "_CONSTANT_": 113,
      "RE": 114,
      "TUR": 115,
      "RETUR": 116,
      "ENT": 117,
      "MENT": 118,
      "UMENT": 119,
      "_ARGUMENT": 120,
      "_ARGUMENTS": 121,
      "CALL_NAME_LOAD_NAME_LOAD_": 122,
      "CONSTANT_ASSIGN_NAME_STORE_": 123,
      "EF": 124,
      "FU": 125,
      "IO": 126,
      "NCT": 127,
      "NDEF": 128,
      "FUNCT": 129,
      "IONDEF": 130,
      "FUNCTIONDEF": 131,
      "FUNCTIONDEF_ARGUMENTS": 132,
      "DU": 133,
      "MODU": 134,
      "MODULE_": 135,
      "MODULE_FUNCTIONDEF_ARGUMENTS": 136,
      "ATTRIBUTE_NAME_LOAD_LOAD_LOAD_": 137,
      "RETURN_": 138,
      "EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_": 139,
      "LOAD": 140,
      "P_": 141,
      "IF_COMPARE_": 142,
      "_EXPR_": 143,
      "BI": 144,
      "CONSTANT_CONSTANT_": 145,
      "BINO": 146,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG": 147,
      "_ATTRIBUTE_NAME_LOAD_LOAD_": 148,
      "LI": 149,
      "CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_": 150,
      "PLE_": 151,
      "TUPLE_": 152,
      "NAME_LOAD_NAME_LOAD_": 153,
      "NOT": 154,
      "NAME_LOAD": 155,
      "RY": 156,
      "IS": 157,
      "SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_": 158,
      "OR_": 159,
      "LIST": 160,
      "EQ": 161,
      "_ATTRIBUTE_": 162,
      "NAME_LOAD_ASSIGN_NAME_STORE_": 163,
      "DD_": 164,
      "NAME_LOAD_STORE_": 165,
      "IF_COMPARE_NAME_LOAD_": 166,
      "BINOP": 167,
      "FOR_": 168,
      "OP_": 169,
      "UNA": 170,
      "RYOP_": 171,
      "UNARYOP_": 172,
      "_ARG_EXPR_": 173,
      "KEYWORD_NAME_LOAD_": 174,
      "N_ATTRIBUTE_": 175,
      "ATTRIBUTE_": 176,
      "CALL_ATTRIBUTE_NAME_LOAD_LOAD_NAME_LOAD_": 177,
      "SSIGN_ATTRIBUTE_": 178,
      "ADD_": 179,
      "SSIGN_ATTRIBUTE_NAME_LOAD_STORE_": 180,
      "DI": 181,
      "FOR_NAME_STORE_": 182,
      "ASSIGN_": 183,
      "SUBSCRIPT_ATTRIBUTE_NAME_LOAD_LOAD_": 184,
      "RA": 185,
      "KEYWORD_CONSTANT_": 186,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_EXPR_": 187,
      "UNARYOP_NOT": 188,
      "BO": 189,
      "OLO": 190,
      "BOOLO": 191,
      "NAME_STORE_NAME_STORE_": 192,
      "BINOP_": 193,
      "DICT": 194,
      "RAIS": 195,
      "CALL_ATTRIBUTE_CONSTANT_LOAD_": 196,
      "RAISE_": 197,
      "LIST_": 198,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_EXPR_": 199,
      "RETURN_NAME_LOAD": 200,
      "SUBSCRIPT_": 201,
      "ER": 202,
      "TUPLE_NAME_STORE_NAME_STORE_": 203,
      "ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_": 204,
      "CONSTANT_IF_": 205,
      "CONSTANT_STORE_": 206,
      "CALL_ATTRIBUTE_NAME_LOAD_LOAD_CONSTANT_": 207,
      "EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_NAME_LOAD_": 208,
      "ASSIGN_ATTRIBUTE_NAME_LOAD_STORE_": 209,
      "ND_": 210,
      "RAISE_CALL_NAME_LOAD_": 211,
      "IN_": 212,
      "EN": 213,
      "EXPR_CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_": 214,
      "COMPARE_NAME_LOAD_": 215,
      "IT": 216,
      "TUPLE_NAME_STORE_NAME_STORE_STORE_": 217,
      "IF_NAME_LOAD_": 218,
      "MOD_": 219,
      "P_A": 220,
      "BOOLOP_A": 221,
      "BOOLOP_AND_": 222,
      "AND": 223,
      "CE": 224,
      "HAND": 225,
      "LER": 226,
      "EXCE": 227,
      "PTHAND": 228,
      "EXCEPTHAND": 229,
      "EXCEPTHANDLER": 230,
      "_CONSTANT_ASSIGN_NAME_STORE_": 231,
      "EQ_CONSTANT_": 232,
      "BINOP_NAME_LOAD_": 233,
      "ASSIGN_SUBSCRIPT_NAME_LOAD_": 234,
      "BINOP_CONSTANT_": 235,
      "TRY": 236,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_ARG_ARG": 237,
      "BINOP_CONSTANT_MOD_": 238,
      "CONSTANT_CONSTANT_CONSTANT_CONSTANT_": 239,
      "CALL_NAME_LOAD_NAME_LOAD_NAME_LOAD_": 240,
      "SUBSCRIPT_NAME_LOAD_NAME_LOAD_LOAD_": 241,
      "EH": 242,
      "ON_": 243,
      "SION_": 244,
      "PREH": 245,
      "COMPREH": 246,
      "ENSION_": 247,
      "COMPREHENSION_": 248,
      "ASSIGN_NAME_STORE_CALL_ATTRIBUTE_NAME_LOAD_LOAD_": 249,
      "CALL_NAME_LOAD_ATTRIBUTE_NAME_LOAD_LOAD_": 250,
      "EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_CONSTANT_": 251,
      "DICT_CONSTANT_": 252,
      "_CONSTANT_EXPR_": 253,
      "NAME_LOAD_LOAD": 254,
      "KEYWORD_NAME_LOAD_KEYWORD_NAME_LOAD_": 255,
      "IF_COMPARE_NAME_LOAD_IS": 256,
      "LIST_LOAD_": 257,
      "_ASSIGN_NAME_STORE_": 258,
      "CONSTANT_ASSIGN_NAME_STORE_CALL_ATTRIBUTE_NAME_LOAD_LOAD_": 259,
      "CONSTANT_ASSIGN_": 260,
      "UNARYOP_NOT_": 261,
      "CONSTANT_RETURN_": 262,
      "CONSTANT_EXPR_": 263,
      "CE_": 264,
      "SLI": 265,
      "SLICE_": 266,
      "COMPREHENSION_NAME_STORE_": 267,
      "KEYWORD_ATTRIBUTE_NAME_LOAD_LOAD_": 268,
      "UG": 269,
      "WIT": 270,
      "WITH": 271,
      "EXCEPTHANDLER_NAME_LOAD_": 272,
      "TUPLE_NAME_LOAD_": 273,
      "IF_COMPARE_ATTRIBUTE_NAME_LOAD_LOAD_": 274,
      "IN": 275,
      "CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_NAME_LOAD_": 276,
      "SUBSCRIPT_ATTRIBUTE_NAME_LOAD_LOAD_CONSTANT_LOAD_": 277,
      "LISTCOMP": 278,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_EXPR_CONSTANT_ASSIGN_NAME_STORE_": 279,
      "BOOLOP_": 280,
      "CONSTANT_ASSIGN_ATTRIBUTE_NAME_LOAD_STORE_": 281,
      "UNARYOP_NOT_NAME_LOAD_": 282,
      "CONSTANT_ADD_": 283,
      "IF_BOOLOP_AND_": 284,
      "BINOP_NAME_LOAD_ADD_": 285,
      "IN_NAME_LOAD_": 286,
      "UNARYOP_U": 287,
      "UNARYOP_USUB": 288,
      "UGASSIGN_NAME_STORE_": 289,
      "KEYWORD_CONSTANT_KEYWORD_CONSTANT_": 290,
      "AS": 291,
      "ATTRIBUTE_NAME_LOAD_LOAD_ATTRIBUTE_NAME_LOAD_LOAD_": 292,
      "ASSIGN_SUBSCRIPT_NAME_LOAD_CONSTANT_STORE_": 293,
      "ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_LOAD_": 294,
      "FOR_NAME_STORE_NAME_LOAD_": 295,
      "ATTRIBUTE_NAME_LOAD_LOAD_ASSIGN_NAME_STORE_": 296,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_EXPR_CONSTANT_ASSIGN_NAME_STORE_": 297,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_ARG_EXPR_": 298,
      "UGASSIGN_NAME_STORE_ADD_": 299,
      "EXPR_CALL_NAME_LOAD_": 300,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_EXPR_CONSTANT_": 301,
      "EQ_": 302,
      "EXPR_CALL_ATTRIBUTE_": 303,
      "NAME_LOAD_ASSIGN_NAME_STORE_CALL_ATTRIBUTE_NAME_LOAD_LOAD_": 304,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_ARG": 305,
      "CONSTANT_CONSTANT_LOAD_": 306,
      "TRY_ASSIGN_NAME_STORE_": 307,
      "NAME_LOAD_RETURN_": 308,
      "EL": 309,
      "GT": 310,
      "TUPLE_NAME_LOAD_NAME_LOAD_LOAD_": 311,
      "SUBSCRIPT_NAME_LOAD_SLICE_": 312,
      "CONSTANT_ASSIGN_SUBSCRIPT_NAME_LOAD_": 313,
      "FOR_TUPLE_NAME_STORE_NAME_STORE_STORE_": 314,
      "LISTCOMP_": 315,
      "CALL_NAME_LOAD_NAME_LOAD_ASSIGN_NAME_STORE_": 316,
      "BOOLOP_OR_": 317,
      "LIST_CONSTANT_": 318,
      "BINOP_BINOP_": 319,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_EXPR_CONSTANT_": 320,
      "IF_ATTRIBUTE_NAME_LOAD_LOAD_": 321,
      "EQ_CONSTANT_ASSIGN_NAME_STORE_": 322,
      "EQ_NAME_LOAD_": 323,
      "CALL_ATTRIBUTE_CONSTANT_LOAD_NAME_LOAD_": 324,
      "ISNOT": 325,
      "SUBSCRIPT_ATTRIBUTE_NAME_LOAD_LOAD_NAME_LOAD_LOAD_": 326,
      "SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_LOAD_": 327,
      "COMPARE_ATTRIBUTE_NAME_LOAD_LOAD_": 328,
      "_WITH": 329,
      "UE_": 330,
      "EXP_": 331,
      "CONSTANT_ATTRIBUTE_NAME_LOAD_LOAD_": 332,
      "EM": 333,
      "ITEM": 334,
      "_WITHITEM": 335,
      "NAME_LOAD_NAME_LOAD_NAME_LOAD_NAME_LOAD_": 336,
      "_CONSTANT_LOAD_": 337,
      "ASSIGN_NAME_STORE_CALL_NAME_LOAD_": 338,
      "IF_UNARYOP_NOT_": 339,
      "CONSTANT_ASSIGN_SUBSCRIPT_NAME_LOAD_CONSTANT_STORE_": 340,
      "DICT_": 341,
      "IF_COMPARE_NAME_LOAD_ISNOT": 342,
      "CONSTANT_EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_": 343,
      "IF_COMPARE_CONSTANT_": 344,
      "_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_": 345,
      "T_": 346,
      "AUGASSIGN_NAME_STORE_ADD_": 347,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_CONSTANT_EXPR_": 348,
      "TRY_": 349,
      "CALL_ATTRIBUTE_CALL_ATTRIBUTE_NAME_LOAD_LOAD_": 350,
      "IF_COMPARE_CALL_NAME_LOAD_NAME_LOAD_": 351,
      "WITH_WITHITEM": 352,
      "SUBSCRIPT_SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_": 353,
      "IF_COMPARE_NAME_LOAD_NOT": 354,
      "CONSTANT_NAME_LOAD_": 355,
      "IN_ATTRIBUTE_NAME_LOAD_LOAD_": 356,
      "ASS": 357,
      "CALL_ATTRIBUTE_NAME_LOAD_LOAD_NAME_LOAD_NAME_LOAD_": 358,
      "CONSTANT_ASSIGN_NAME_STORE_CALL_NAME_LOAD_": 359,
      "IF_UNARYOP_NOT_NAME_LOAD_": 360,
      "ASSIGN_SUBSCRIPT_NAME_LOAD_NAME_LOAD_STORE_": 361,
      "_CONSTANT_CONSTANT_EXPR_": 362,
      "UNARYOP_USUB_CONSTANT_LOAD_": 363,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_ARG_CONSTANT_EXPR_": 364,
      "ATTRIBUTE_NAME_LOAD_LOAD": 365,
      "WITH_WITHITEM_": 366,
      "CONT": 367,
      "CONTIN": 368,
      "CONTINUE_": 369,
      "KEYWORD_NAME_LOAD": 370,
      "ASSIGN_TUPLE_NAME_STORE_NAME_STORE_STORE_": 371,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_ARG_ARG_ARG_ARG": 372,
      "TUPLE_NAME_LOAD_NAME_LOAD_": 373,
      "CALL_NAME_LOAD_NAME_LOAD_CONSTANT_": 374,
      "IF_CALL_NAME_LOAD_NAME_LOAD_": 375,
      "RETURN_CALL_NAME_LOAD_": 376,
      "EQ_ATTRIBUTE_NAME_LOAD_LOAD_": 377,
      "IF_COMPARE_NAME_LOAD_IS_CONSTANT_ASSIGN_NAME_STORE_": 378,
      "BINOP_ATTRIBUTE_NAME_LOAD_LOAD_": 379,
      "NAME_LOAD_RETURN_NAME_LOAD": 380,
      "_ALI": 381,
      "_ALIAS": 382,
      "RETURN_CALL_ATTRIBUTE_NAME_LOAD_LOAD_": 383,
      "BINOP_CONSTANT_ADD_": 384,
      "CONSTANT_LOAD_ASSIGN_NAME_STORE_": 385,
      "IEL": 386,
      "YIEL": 387,
      "ISNOT_CONSTANT_": 388,
      "CONSTANT_IF_BOOLOP_AND_": 389,
      "CONSTANT_IF_UNARYOP_NOT_": 390,
      "CONSTANT_LOAD_LOAD_": 391,
      "CALL_NAME_LOAD_NAME_LOAD_NAME_LOAD_NAME_LOAD_": 392,
      "IS_CONSTANT_": 393,
      "CALL_ATTRIBUTE_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_LOAD_": 394,
      "IF_COMPARE_NAME_LOAD_EQ_CONSTANT_": 395,
      "NAME_LOAD_EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_": 396,
      "SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_ASSIGN_NAME_STORE_": 397,
      "IF_NAME_LOAD_ASSIGN_NAME_STORE_": 398,
      "ERT_": 399,
      "CALL_NAME_LOAD_CONSTANT_": 400,
      "CALL_ATTRIBUTE_NAME_LOAD_LOAD_ATTRIBUTE_NAME_LOAD_LOAD_": 401,
      "LT": 402,
      "IFEXP_": 403,
      "ASSIGN_SUBSCRIPT_ATTRIBUTE_NAME_LOAD_LOAD_": 404,
      "TOR": 405,
      "IM": 406,
      "POR": 407,
      "DIV": 408,
      "IMPOR": 409,
      "IMPORT": 410,
      "DEL": 411,
      "KEYWORD_ATTRIBUTE_NAME_LOAD_LOAD_KEYWORD_ATTRIBUTE_NAME_LOAD_LOAD_": 412,
      "BINOP_NAME_LOAD_SUB": 413,
      "UNARYOP_NOT_ATTRIBUTE_NAME_LOAD_LOAD_": 414,
      "DICT_CONSTANT_CONSTANT_CONSTANT_": 415,
      "HI": 416,
      "WHI": 417,
      "WHILE_": 418,
      "IF_COMPARE_NAME_LOAD_IS_CONSTANT_": 419,
      "CONSTANT_CONSTANT_CONSTANT_CONSTANT_CONSTANT_CONSTANT_CONSTANT_CONSTANT_": 420,
      "COMPREHENSION_NAME_STORE_NAME_LOAD_": 421,
      "RETURN": 422,
      "_CONSTANT_CONSTANT_CONSTANT_": 423,
      "YIELD_": 424,
      "FOR_NAME_STORE_ATTRIBUTE_NAME_LOAD_LOAD_": 425,
      "ARG": 426,
      "CONSTANT_ASSIGN_NAME_STORE_CALL_ATTRIBUTE_NAME_LOAD_LOAD_NAME_LOAD_": 427,
      "EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_NAME_LOAD_NAME_LOAD_": 428,
      "NAME_LOAD_ASSIGN_NAME_STORE_CALL_ATTRIBUTE_NAME_LOAD_LOAD_NAME_LOAD_": 429,
      "COMPARE_CONSTANT_": 430,
      "CALL_": 431,
      "ASSIGN_NAME_STORE_CALL_ATTRIBUTE_NAME_LOAD_LOAD_NAME_LOAD_": 432,
      "CALL_NAME_LOAD_SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_": 433,
      "CALL_NAME_LOAD_NAME_LOAD_LOAD_": 434,
      "TUPLE_CONSTANT_CONSTANT_LOAD_": 435,
      "RETURN_NAME_LOAD_": 436,
      "KEYWORD_NAME_LOAD_KEYWORD_": 437,
      "ATTRIBUTE_NAME_LOAD_LOAD_STORE_": 438,
      "NAME_STORE_STORE_": 439,
      "EXPR_CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_NAME_LOAD_": 440,
      "KEYWORD_CONSTANT_KEYWORD_": 441,
      "RAISE_CALL_NAME_LOAD_BINOP_CONSTANT_MOD_": 442,
      "CONSTANT_ASSIGN_TUPLE_NAME_STORE_NAME_STORE_STORE_": 443,
      "RETURN_CONSTANT_": 444,
      "BOOLOP_OR": 445,
      "IF_BOOLOP_OR_": 446,
      "PASS": 447,
      "EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_ATTRIBUTE_NAME_LOAD_LOAD_": 448,
      "CALL_NAME_LOAD_CALL_ATTRIBUTE_NAME_LOAD_LOAD_": 449,
      "ERA": 450,
      "GEN": 451,
      "ERATOR": 452,
      "GENERATOR": 453,
      "EXP": 454,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_ARG_ARG_EXPR_": 455,
      "EXPR_CALL_NAME_LOAD_NAME_LOAD_": 456,
      "AK": 457,
      "BRE": 458,
      "BREAK": 459,
      "FR": 460,
      "OM": 461,
      "FROM": 462,
      "LIST_NAME_LOAD_LOAD_": 463,
      "RAISE_CALL_NAME_LOAD_CONSTANT_": 464,
      "GT_CONSTANT_": 465,
      "EXCEPTHANDLER_": 466,
      "IF_COMPARE_NAME_LOAD_EQ_CONSTANT_ASSIGN_NAME_STORE_": 467,
      "CONSTANT_ASSIGN_NAME_STORE_CALL_NAME_LOAD_NAME_LOAD_": 468,
      "LIST_LOAD_ASSIGN_NAME_STORE_": 469,
      "CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_ATTRIBUTE_NAME_LOAD_LOAD_": 470,
      "ED": 471,
      "EXPR_YIELD_": 472,
      "AM": 473,
      "A_ARGUMENTS": 474,
      "BD": 475,
      "LAM": 476,
      "BDA_ARGUMENTS": 477,
      "LAMBDA_ARGUMENTS": 478,
      "NOTEQ_CONSTANT_": 479,
      "NAME_LOAD_ASSIGN_NAME_STORE_CALL_NAME_LOAD_": 480,
      "NAME_LOAD_ASSIGN_ATTRIBUTE_NAME_LOAD_STORE_": 481,
      "COMPARE_CALL_NAME_LOAD_NAME_LOAD_": 482,
      "SUBSCRIPT_NAME_LOAD_NAME_LOAD_LOAD_LOAD_": 483,
      "CONSTANT_ASSIGN_NAME_STORE_CONSTANT_": 484,
      "CALL_ATTRIBUTE_NAME_LOAD_LOAD": 485,
      "EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_CALL_ATTRIBUTE_CONSTANT_LOAD_": 486,
      "CONSTANT_AUGASSIGN_NAME_STORE_ADD_": 487,
      "_NAME_LOAD_ARG": 488,
      "SUBSCRIPT_SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_CONSTANT_LOAD_": 489,
      "SUBSCRIPT_SUBSCRIPT_NAME_LOAD_NAME_LOAD_LOAD_": 490,
      "TUPLE_ATTRIBUTE_NAME_LOAD_LOAD_": 491,
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_ARG_ARG_ARG": 492,
      "CALL_ATTRIBUTE_SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_LOAD_": 493,
      "BIT": 494,
      "CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_CONSTANT_": 495,
      "CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_NAME_LOAD_NAME_LOAD_": 496,
      "DICT_CONSTANT_CONSTANT_": 497,
      "KEYWORD_NAME_LOAD_KEYWORD_NAME_LOAD_KEYWORD_NAME_LOAD_KEYWORD_NAME_LOAD_": 498,
      "NAME_LOAD_ASSIGN_NAME_STORE_CALL_NAME_LOAD_NAME_LOAD_": 499
    },
    "merges": [
      "E _",
      "D _",
      "L O",
      "LO A",
      "LOA D_",
      "N A",
      "M E_",
      "NA ME_",
      "NAME_ LOAD_",
      "S T",
      "_ A",
      "R I",
      "C O",
      "N T",
      "T E_",
      "T T",
      "B U",
      "RI BU",
      "TT RIBU",
      "TTRIBU TE_",
      "A NT",
      "N ST",
      "CO NST",
      "CONST ANT",
      "O R",
      "NAME_LOAD_ LOAD_",
      "A L",
      "C AL",
      "CAL L",
      "CONSTANT _",
      "TTRIBUTE_ NAME_LOAD_LOAD_",
      "ST OR",
      "STOR E_",
      "N _",
      "_ NAME_LOAD_",
      "CALL _A",
      "NAME_ STORE_",
      "S I",
      "R G",
      "S SI",
      "SSI G",
      "_A RG",
      "SSIG N_",
      "E X",
      "P R",
      "CALL_A TTRIBUTE_NAME_LOAD_LOAD_",
      "SSIGN_ NAME_STORE_",
      "EX PR",
      "EXPR _",
      "A TTRIBUTE_NAME_LOAD_LOAD_",
      "CALL _NAME_LOAD_",
      "S U",
      "SU B",
      "P T",
      "I F",
      "T U",
      "L E_",
      "C RI",
      "S CRI",
      "SUB SCRI",
      "SUBSCRI PT",
      "CONSTANT _A",
      "A SSIGN_NAME_STORE_",
      "CO M",
      "_ARG _ARG",
      "IF _",
      "CONSTANT_ LOAD_",
      "COM P",
      "CALL_A TTRIBUTE_",
      "C T",
      "N O",
      "M O",
      "N D",
      "E Y",
      "K EY",
      "W OR",
      "KEY WOR",
      "KEYWOR D_",
      "A R",
      "COMP AR",
      "COMPAR E_",
      "SUBSCRIPT _NAME_LOAD_",
      "_ CONSTANT_",
      "R E",
      "TU R",
      "RE TUR",
      "E NT",
      "M ENT",
      "U MENT",
      "_ARG UMENT",
      "_ARGUMENT S",
      "CALL_NAME_LOAD_ NAME_LOAD_",
      "CONSTANT_A SSIGN_NAME_STORE_",
      "E F",
      "F U",
      "I O",
      "N CT",
      "ND EF",
      "FU NCT",
      "IO NDEF",
      "FUNCT IONDEF",
      "FUNCTIONDEF _ARGUMENTS",
      "D U",
      "MO DU",
      "MODU LE_",
      "MODULE_ FUNCTIONDEF_ARGUMENTS",
      "ATTRIBUTE_NAME_LOAD_LOAD_ LOAD_",
      "RETUR N_",
      "EXPR_ CALL_ATTRIBUTE_NAME_LOAD_LOAD_",
      "LOA D",
      "P _",
      "IF_ COMPARE_",
      "_ EXPR_",
      "B I",
      "CONSTANT_ CONSTANT_",
      "BI NO",
      "MODULE_FUNCTIONDEF_ARGUMENTS _ARG_ARG",
      "_A TTRIBUTE_NAME_LOAD_LOAD_",
      "L I",
      "CALL_ATTRIBUTE_ ATTRIBUTE_NAME_LOAD_LOAD_LOAD_",
      "P LE_",
      "TU PLE_",
      "NAME_LOAD_ NAME_LOAD_",
      "NO T",
      "NAME_ LOAD",
      "R Y",
      "I S",
      "SUBSCRIPT_NAME_LOAD_ CONSTANT_LOAD_",
      "OR _",
      "LI ST",
      "E Q",
      "_A TTRIBUTE_",
      "NAME_LOAD_ ASSIGN_NAME_STORE_",
      "D D_",
      "NAME_LOAD_ STORE_",
      "IF_COMPARE_ NAME_LOAD_",
      "BINO P",
      "F OR_",
      "O P_",
      "U NA",
      "RY OP_",
      "UNA RYOP_",
      "_ARG _EXPR_",
      "KEYWORD_ NAME_LOAD_",
      "N _ATTRIBUTE_",
      "A TTRIBUTE_",
      "CALL_ATTRIBUTE_NAME_LOAD_LOAD_ NAME_LOAD_",
      "SSIG N_ATTRIBUTE_",
      "A DD_",
      "SSIGN_ATTRIBUTE_ NAME_LOAD_STORE_",
      "D I",
      "FOR_ NAME_STORE_",
      "A SSIGN_",
      "SUBSCRIPT _ATTRIBUTE_NAME_LOAD_LOAD_",
      "R A",
      "KEYWORD_ CONSTANT_",
      "MODULE_FUNCTIONDEF_ARGUMENTS _ARG_EXPR_",
      "UNARYOP_ NOT",
      "B O",
      "O LO",
      "BO OLO",
      "NAME_STORE_ NAME_STORE_",
      "BINO P_",
      "DI CT",
      "RA IS",
      "CALL_ATTRIBUTE_ CONSTANT_LOAD_",
      "RAIS E_",
      "LIST _",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG _EXPR_",
      "RETURN_ NAME_LOAD",
      "SUBSCRIPT _",
      "E R",
      "TUPLE_ NAME_STORE_NAME_STORE_",
      "ATTRIBUTE_ ATTRIBUTE_NAME_LOAD_LOAD_LOAD_",
      "CONSTANT_ IF_",
      "CONSTANT_ STORE_",
      "CALL_ATTRIBUTE_NAME_LOAD_LOAD_ CONSTANT_",
      "EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_ NAME_LOAD_",
      "A SSIGN_ATTRIBUTE_NAME_LOAD_STORE_",
      "N D_",
      "RAISE_ CALL_NAME_LOAD_",
      "I N_",
      "E N",
      "EXPR_ CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_",
      "COMPARE_ NAME_LOAD_",
      "I T",
      "TUPLE_NAME_STORE_NAME_STORE_ STORE_",
      "IF _NAME_LOAD_",
      "MO D_",
      "P _A",
      "BOOLO P_A",
      "BOOLOP_A ND_",
      "A ND",
      "C E",
      "H AND",
      "L ER",
      "EX CE",
      "PT HAND",
      "EXCE PTHAND",
      "EXCEPTHAND LER",
      "_ CONSTANT_ASSIGN_NAME_STORE_",
      "EQ _CONSTANT_",
      "BINOP _NAME_LOAD_",
      "ASSIGN_ SUBSCRIPT_NAME_LOAD_",
      "BINOP _CONSTANT_",
      "T RY",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG _ARG_ARG",
      "BINOP_CONSTANT_ MOD_",
      "CONSTANT_CONSTANT_ CONSTANT_CONSTANT_",
      "CALL_NAME_LOAD_NAME_LOAD_ NAME_LOAD_",
      "SUBSCRIPT_NAME_LOAD_ NAME_LOAD_LOAD_",
      "E H",
      "O N_",
      "SI ON_",
      "PR EH",
      "COM PREH",
      "EN SION_",
      "COMPREH ENSION_",
      "ASSIGN_NAME_STORE_ CALL_ATTRIBUTE_NAME_LOAD_LOAD_",
      "CALL_NAME_LOAD_ ATTRIBUTE_NAME_LOAD_LOAD_",
      "EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_ CONSTANT_",
      "DICT _CONSTANT_",
      "_CONSTANT_ EXPR_",
      "NAME_LOAD_ LOAD",
      "KEYWORD_NAME_LOAD_ KEYWORD_NAME_LOAD_",
      "IF_COMPARE_NAME_LOAD_ IS",
      "LIST_ LOAD_",
      "_A SSIGN_NAME_STORE_",
      "CONSTANT_ASSIGN_NAME_STORE_ CALL_ATTRIBUTE_NAME_LOAD_LOAD_",
      "CONSTANT_A SSIGN_",
      "UNARYOP_NOT _",
      "CONSTANT_ RETURN_",
      "CONSTANT_ EXPR_",
      "C E_",
      "S LI",
      "SLI CE_",
      "COMPREHENSION_ NAME_STORE_",
      "KEYWORD_ ATTRIBUTE_NAME_LOAD_LOAD_",
      "U G",
      "W IT",
      "WIT H",
      "EXCEPTHANDLER _NAME_LOAD_",
      "TUPLE_ NAME_LOAD_",
      "IF_COMPARE_ ATTRIBUTE_NAME_LOAD_LOAD_",
      "I N",
      "CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_ NAME_LOAD_",
      "SUBSCRIPT_ATTRIBUTE_NAME_LOAD_LOAD_ CONSTANT_LOAD_",
      "LIST COMP",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_EXPR_ CONSTANT_ASSIGN_NAME_STORE_",
      "BOOLO P_",
      "CONSTANT_A SSIGN_ATTRIBUTE_NAME_LOAD_STORE_",
      "UNARYOP_NOT _NAME_LOAD_",
      "CONSTANT_A DD_",
      "IF_ BOOLOP_AND_",
      "BINOP_NAME_LOAD_ ADD_",
      "IN_ NAME_LOAD_",
      "UNARYOP_ U",
      "UNARYOP_U SUB",
      "UG ASSIGN_NAME_STORE_",
      "KEYWORD_CONSTANT_ KEYWORD_CONSTANT_",
      "A S",
      "ATTRIBUTE_NAME_LOAD_LOAD_ ATTRIBUTE_NAME_LOAD_LOAD_",
      "ASSIGN_SUBSCRIPT_NAME_LOAD_ CONSTANT_STORE_",
      "ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_ LOAD_",
      "FOR_NAME_STORE_ NAME_LOAD_",
      "ATTRIBUTE_NAME_LOAD_LOAD_ ASSIGN_NAME_STORE_",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_EXPR_ CONSTANT_ASSIGN_NAME_STORE_",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG _ARG_EXPR_",
      "UGASSIGN_NAME_STORE_ ADD_",
      "EXPR_ CALL_NAME_LOAD_",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_EXPR_ CONSTANT_",
      "EQ _",
      "EXPR_ CALL_ATTRIBUTE_",
      "NAME_LOAD_ASSIGN_NAME_STORE_ CALL_ATTRIBUTE_NAME_LOAD_LOAD_",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG _ARG",
      "CONSTANT_ CONSTANT_LOAD_",
      "TRY _ASSIGN_NAME_STORE_",
      "NAME_LOAD_ RETURN_",
      "E L",
      "G T",
      "TUPLE_NAME_LOAD_ NAME_LOAD_LOAD_",
      "SUBSCRIPT_NAME_LOAD_ SLICE_",
      "CONSTANT_ASSIGN_ SUBSCRIPT_NAME_LOAD_",
      "FOR_ TUPLE_NAME_STORE_NAME_STORE_STORE_",
      "LISTCOMP _",
      "CALL_NAME_LOAD_NAME_LOAD_ ASSIGN_NAME_STORE_",
      "BOOLOP_ OR_",
      "LIST _CONSTANT_",
      "BINOP_ BINOP_",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_EXPR_ CONSTANT_",
      "IF _ATTRIBUTE_NAME_LOAD_LOAD_",
      "EQ _CONSTANT_ASSIGN_NAME_STORE_",
      "EQ _NAME_LOAD_",
      "CALL_ATTRIBUTE_CONSTANT_LOAD_ NAME_LOAD_",
      "IS NOT",
      "SUBSCRIPT_ATTRIBUTE_NAME_LOAD_LOAD_ NAME_LOAD_LOAD_",
      "SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_ LOAD_",
      "COMPARE_ ATTRIBUTE_NAME_LOAD_LOAD_",
      "_ WITH",
      "U E_",
      "EX P_",
      "CONSTANT_A TTRIBUTE_NAME_LOAD_LOAD_",
      "E M",
      "IT EM",
      "_WITH ITEM",
      "NAME_LOAD_NAME_LOAD_ NAME_LOAD_NAME_LOAD_",
      "_ CONSTANT_LOAD_",
      "ASSIGN_NAME_STORE_ CALL_NAME_LOAD_",
      "IF_ UNARYOP_NOT_",
      "CONSTANT_ASSIGN_SUBSCRIPT_NAME_LOAD_ CONSTANT_STORE_",
      "DICT _",
      "IF_COMPARE_NAME_LOAD_IS NOT",
      "CONSTANT_ EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_",
      "IF_COMPARE_ CONSTANT_",
      "_ATTRIBUTE_ ATTRIBUTE_NAME_LOAD_LOAD_LOAD_",
      "T _",
      "A UGASSIGN_NAME_STORE_ADD_",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG _CONSTANT_EXPR_",
      "TRY _",
      "CALL_ATTRIBUTE_ CALL_ATTRIBUTE_NAME_LOAD_LOAD_",
      "IF_COMPARE_ CALL_NAME_LOAD_NAME_LOAD_",
      "WITH _WITHITEM",
      "SUBSCRIPT_ SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_",
      "IF_COMPARE_NAME_LOAD_ NOT",
      "CONSTANT_ NAME_LOAD_",
      "IN _ATTRIBUTE_NAME_LOAD_LOAD_",
      "AS S",
      "CALL_ATTRIBUTE_NAME_LOAD_LOAD_ NAME_LOAD_NAME_LOAD_",
      "CONSTANT_ASSIGN_NAME_STORE_ CALL_NAME_LOAD_",
      "IF_ UNARYOP_NOT_NAME_LOAD_",
      "ASSIGN_SUBSCRIPT_NAME_LOAD_ NAME_LOAD_STORE_",
      "_CONSTANT_ CONSTANT_EXPR_",
      "UNARYOP_USUB _CONSTANT_LOAD_",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_ARG _CONSTANT_EXPR_",
      "ATTRIBUTE_ NAME_LOAD_LOAD",
      "WITH_WITHITEM _",
      "CO NT",
      "CONT IN",
      "CONTIN UE_",
      "KEYWORD_ NAME_LOAD",
      "ASSIGN_ TUPLE_NAME_STORE_NAME_STORE_STORE_",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_ARG_ARG _ARG_ARG",
      "TUPLE_ NAME_LOAD_NAME_LOAD_",
      "CALL_NAME_LOAD_NAME_LOAD_ CONSTANT_",
      "IF_ CALL_NAME_LOAD_NAME_LOAD_",
      "RETURN_ CALL_NAME_LOAD_",
      "EQ _ATTRIBUTE_NAME_LOAD_LOAD_",
      "IF_COMPARE_NAME_LOAD_IS _CONSTANT_ASSIGN_NAME_STORE_",
      "BINOP _ATTRIBUTE_NAME_LOAD_LOAD_",
      "NAME_LOAD_ RETURN_NAME_LOAD",
      "_A LI",
      "_ALI AS",
      "RETURN_ CALL_ATTRIBUTE_NAME_LOAD_LOAD_",
      "BINOP_ CONSTANT_ADD_",
      "CONSTANT_LOAD_ ASSIGN_NAME_STORE_",
      "I EL",
      "Y IEL",
      "ISNOT _CONSTANT_",
      "CONSTANT_IF_ BOOLOP_AND_",
      "CONSTANT_IF_ UNARYOP_NOT_",
      "CONSTANT_LOAD_ LOAD_",
      "CALL_NAME_LOAD_NAME_LOAD_ NAME_LOAD_NAME_LOAD_",
      "IS _CONSTANT_",
      "CALL_ATTRIBUTE_ ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_LOAD_",
      "IF_COMPARE_NAME_LOAD_ EQ_CONSTANT_",
      "NAME_LOAD_ EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_",
      "SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_ ASSIGN_NAME_STORE_",
      "IF_NAME_LOAD_ ASSIGN_NAME_STORE_",
      "ER T_",
      "CALL_NAME_LOAD_ CONSTANT_",
      "CALL_ATTRIBUTE_NAME_LOAD_LOAD_ ATTRIBUTE_NAME_LOAD_LOAD_",
      "L T",
      "IF EXP_",
      "ASSIGN_ SUBSCRIPT_ATTRIBUTE_NAME_LOAD_LOAD_",
      "T OR",
      "I M",
      "P OR",
      "DI V",
      "IM POR",
      "IMPOR T",
      "D EL",
      "KEYWORD_ATTRIBUTE_NAME_LOAD_LOAD_ KEYWORD_ATTRIBUTE_NAME_LOAD_LOAD_",
      "BINOP_NAME_LOAD_ SUB",
      "UNARYOP_NOT _ATTRIBUTE_NAME_LOAD_LOAD_",
      "DICT_CONSTANT_ CONSTANT_CONSTANT_",
      "H I",
      "W HI",
      "WHI LE_",
      "IF_COMPARE_NAME_LOAD_IS _CONSTANT_",
      "CONSTANT_CONSTANT_CONSTANT_CONSTANT_ CONSTANT_CONSTANT_CONSTANT_CONSTANT_",
      "COMPREHENSION_NAME_STORE_ NAME_LOAD_",
      "RETUR N",
      "_CONSTANT_ CONSTANT_CONSTANT_",
      "YIEL D_",
      "FOR_NAME_STORE_ ATTRIBUTE_NAME_LOAD_LOAD_",
      "A RG",
      "CONSTANT_ASSIGN_NAME_STORE_ CALL_ATTRIBUTE_NAME_LOAD_LOAD_NAME_LOAD_",
      "EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_ NAME_LOAD_NAME_LOAD_",
      "NAME_LOAD_ASSIGN_NAME_STORE_ CALL_ATTRIBUTE_NAME_LOAD_LOAD_NAME_LOAD_",
      "COMPARE_ CONSTANT_",
      "CALL _",
      "ASSIGN_NAME_STORE_ CALL_ATTRIBUTE_NAME_LOAD_LOAD_NAME_LOAD_",
      "CALL_NAME_LOAD_ SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_",
      "CALL_NAME_LOAD_ NAME_LOAD_LOAD_",
      "TUPLE_ CONSTANT_CONSTANT_LOAD_",
      "RETURN_ NAME_LOAD_",
      "KEYWORD_NAME_LOAD_ KEYWORD_",
      "ATTRIBUTE_NAME_LOAD_LOAD_ STORE_",
      "NAME_STORE_ STORE_",
      "EXPR_CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_ NAME_LOAD_",
      "KEYWORD_CONSTANT_ KEYWORD_",
      "RAISE_CALL_NAME_LOAD_ BINOP_CONSTANT_MOD_",
      "CONSTANT_ASSIGN_ TUPLE_NAME_STORE_NAME_STORE_STORE_",
      "RETURN_ CONSTANT_",
      "BOOLOP_ OR",
      "IF_ BOOLOP_OR_",
      "P ASS",
      "EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_ ATTRIBUTE_NAME_LOAD_LOAD_",
      "CALL_NAME_LOAD_ CALL_ATTRIBUTE_NAME_LOAD_LOAD_",
      "E RA",
      "G EN",
      "ERA TOR",
      "GEN ERATOR",
      "EX P",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_ARG_ARG _EXPR_",
      "EXPR_ CALL_NAME_LOAD_NAME_LOAD_",
      "A K",
      "B RE",
      "BRE AK",
      "F R",
      "O M",
      "FR OM",
      "LIST_ NAME_LOAD_LOAD_",
      "RAISE_CALL_NAME_LOAD_ CONSTANT_",
      "GT _CONSTANT_",
      "EXCEPTHANDLER _",
      "IF_COMPARE_NAME_LOAD_ EQ_CONSTANT_ASSIGN_NAME_STORE_",
      "CONSTANT_ASSIGN_NAME_STORE_ CALL_NAME_LOAD_NAME_LOAD_",
      "LIST_LOAD_ ASSIGN_NAME_STORE_",
      "CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_ ATTRIBUTE_NAME_LOAD_LOAD_",
      "E D",
      "EXPR_ YIELD_",
      "A M",
      "A _ARGUMENTS",
      "B D",
      "L AM",
      "BD A_ARGUMENTS",
      "LAM BDA_ARGUMENTS",
      "NOT EQ_CONSTANT_",
      "NAME_LOAD_ASSIGN_NAME_STORE_ CALL_NAME_LOAD_",
      "NAME_LOAD_ ASSIGN_ATTRIBUTE_NAME_LOAD_STORE_",
      "COMPARE_ CALL_NAME_LOAD_NAME_LOAD_",
      "SUBSCRIPT_NAME_LOAD_NAME_LOAD_LOAD_ LOAD_",
      "CONSTANT_ASSIGN_NAME_STORE_ CONSTANT_",
      "CALL_ATTRIBUTE_ NAME_LOAD_LOAD",
      "EXPR_CALL_ATTRIBUTE_NAME_LOAD_LOAD_ CALL_ATTRIBUTE_CONSTANT_LOAD_",
      "CONSTANT_A UGASSIGN_NAME_STORE_ADD_",
      "_NAME_LOAD_ ARG",
      "SUBSCRIPT_SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_ CONSTANT_LOAD_",
      "SUBSCRIPT_ SUBSCRIPT_NAME_LOAD_NAME_LOAD_LOAD_",
      "TUPLE_ ATTRIBUTE_NAME_LOAD_LOAD_",
      "MODULE_FUNCTIONDEF_ARGUMENTS_ARG_ARG_ARG_ARG _ARG",
      "CALL_ATTRIBUTE_ SUBSCRIPT_NAME_LOAD_CONSTANT_LOAD_LOAD_",
      "BI T",
      "CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_ CONSTANT_",
      "CALL_ATTRIBUTE_ATTRIBUTE_NAME_LOAD_LOAD_LOAD_ NAME_LOAD_NAME_LOAD_",
      "DICT_CONSTANT_ CONSTANT_",
      "KEYWORD_NAME_LOAD_KEYWORD_NAME_LOAD_ KEYWORD_NAME_LOAD_KEYWORD_NAME_LOAD_",
      "NAME_LOAD_ASSIGN_NAME_STORE_ CALL_NAME_LOAD_NAME_LOAD_"
    ]
  }
}